# Вариант 4


### Задание 1

> Дано трехзначное число. Найдите сумму его цифр.

```
#include <iostream>

using namespace std;

int main()
{
    int number;
    cout << "Введите трехзначное число: ";
    cin >> number;

    int digit1 = number / 100;          
    int digit2 = (number / 10) % 10;    
    int digit3 = number % 10;           

    int sum = digit1 + digit2 + digit3; 

    cout << "Сумма цифр: " << sum << endl;

    return 0;
}
```


### Задание 2 

> Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
Вводятся 3 числа: n, m и k; k не равно n × m. Гарантируется, что количество долек в шоколадке не превосходит 30000.
Программа должна вывести слово YES, если возможно отломить указанное число долек, в противном случае вывести слово NO.

```
#include <iostream>

using namespace std;

int main() {
    int n, m, k;
    cout << "Количество долек в длину: ";
    cin >> n;
    cout << "Количество долек в ширину: ";
    cin >> m;
    cout << "Сколько долек обломить: ";
    cin >> k;

    if (n * m > k) {
        cout << "YES" << endl;
    } else {
        cout << "NO" << endl;
    }

    return 0;
}
```


### Задание 3

> Дано натуральное число N. Напишите программу, вычисляющую сумму цифр числа N.

```
#include <iostream>

using namespace std;

int main() {
    int n;
    cout << "Введите натуральное число N: ";
    cin >> n;

    int sum = 0;
    while (n > 0) {
        int digit = n % 10;  // Получаем последнюю цифру
        sum += digit;        // Добавляем цифру к сумме
        n /= 10;             // Убираем последнюю цифру из числа
    }

    cout << "Сумма чисел: " << sum << endl;

    return 0;
}
```

### Задание 4

> Напишите программу для поиска суммы чисел.
Вводится 2 целых числа a и b (a <= b). Необходимо вычислить сумму всех чисел от a до b включительно.b

```
#include <iostream>

using namespace std;

int main() {
    int a, b;
    cout << "Введите число A: ";
    cin >> a;
    cout << "Введите число B: ";
    cin >> b;
    
    for (int i = a; i <= b; i++) {
        a += i;
    }

    cout << "Сумма чисел от " << a;

    return 0;
}
```

### Задание 5

> Вводится массив (сначала количество элементов, потом сами элементы). Найдите сумму его элементов с чётными индексами и выведите её. А потом выведите числа, которые суммировались. 

```
#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n;
    cout << "Введите количество элементов массива: ";
    cin >> n;

    vector<int> array(n);

    cout << "Введите элементы массива: ";
    for (int i = 0; i < n; i++) {
        cin >> array[i];
    }

    int sum = 0;
    cout << "Элементы с четными индексами: ";
    for (int i = 0; i < n; i += 2) {
        sum += array[i];
        cout << array[i] << " ";
    }

    cout << "\nСумма элементов с четными индексами: " << sum << endl;

    return 0;
}
```

### Задание 5 

> Вводятся 2 натуральных числа: n (кол-во строк) и m (кол-во столбцов). Затем вводится двумерный массив размером n *m. Поверните его на 90 градусов по часовой стрелке и выведите на экран (через пробел).


